; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_9 ?v8 ?v5)
             (pred_6 ?v7 ?v11)
             (pred_7 ?v8 ?v11)
             (pred_3 ?v1 ?v8 )
	     (pred_1 ?v8)
             (pred_4 ?v6)
             (pred_8 ?v7)
             (pred_11 ?v11)
             (pred_2 ?v8)
             (pred_10 ?v7)
             (pred_5 ?v8)
             (pred_12 ))



(:action op_3
:parameters (?v4 ?v10 ?v13 ?v9)
:precondition (and (pred_4 ?v4) (pred_4 ?v10) (pred_8 ?v13) (pred_11 ?v9)
          (pred_9 ?v4 ?v10) (pred_6 ?v13 ?v9)
                   (pred_7 ?v10 ?v9) (pred_1 ?v4) 
                   (pred_2 ?v10) (pred_10 ?v13))
:effect (and  (pred_5 ?v10) (not (pred_2 ?v10))))


(:action op_1
:parameters (?v4 ?v2)
:precondition (and (pred_4 ?v4) (pred_4 ?v2)
               (pred_1 ?v4) (pred_9 ?v4 ?v2) (pred_5 ?v2))
:effect (and (pred_1 ?v2) (not (pred_1 ?v4))))

(:action op_5
:parameters (?v4 ?v13)
:precondition (and (pred_4 ?v4) (pred_8 ?v13) 
                  (pred_1 ?v4) (pred_3 ?v13 ?v4) (pred_12 ))
:effect (and (pred_10 ?v13)
   (not (pred_3 ?v13 ?v4)) (not (pred_12 ))))


(:action op_2
:parameters (?v4 ?v12 ?v3)
:precondition (and (pred_4 ?v4) (pred_8 ?v12) (pred_8 ?v3)
                  (pred_1 ?v4) (pred_10 ?v3) (pred_3 ?v12 ?v4))
:effect (and (pred_10 ?v12) (pred_3 ?v3 ?v4)
        (not (pred_10 ?v3)) (not (pred_3 ?v12 ?v4))))

(:action op_4
:parameters (?v4 ?v13)
:precondition (and (pred_4 ?v4) (pred_8 ?v13) 
                  (pred_1 ?v4) (pred_10 ?v13))
:effect (and (pred_12 ) (pred_3 ?v13 ?v4) (not (pred_10 ?v13)))))

; problem
(define (problem grid-5-5-2-3-3)
    (:domain grid)
    (:objects
    obj_13 obj_10 obj_15 obj_01 obj_08 obj_04 obj_21 obj_02 obj_09 obj_16 obj_20 obj_24 obj_30 obj_06 obj_29 obj_05 obj_17 obj_23 obj_11 obj_25 obj_14 obj_12 obj_26 obj_22 obj_28
    obj_18 obj_27
    obj_03 obj_07 obj_19
    )

    (:init
       (pred_12)

       (pred_4 obj_13)
       (pred_4 obj_10)
       (pred_4 obj_15)
       (pred_4 obj_01)
       (pred_4 obj_08)
       (pred_4 obj_04)
       (pred_4 obj_21)
       (pred_4 obj_02)
       (pred_4 obj_09)
       (pred_4 obj_16)
       (pred_4 obj_20)
       (pred_4 obj_24)
       (pred_4 obj_30)
       (pred_4 obj_06)
       (pred_4 obj_29)
       (pred_4 obj_05)
       (pred_4 obj_17)
       (pred_4 obj_23)
       (pred_4 obj_11)
       (pred_4 obj_25)
       (pred_4 obj_14)
       (pred_4 obj_12)
       (pred_4 obj_26)
       (pred_4 obj_22)
       (pred_4 obj_28)
       (pred_11 obj_18)
       (pred_11 obj_27)
       (pred_8 obj_03)
       (pred_8 obj_07)
       (pred_8 obj_19)

       (pred_9 obj_13 obj_04)
       (pred_9 obj_13 obj_10)
       (pred_9 obj_10 obj_21)
       (pred_9 obj_10 obj_15)
       (pred_9 obj_10 obj_13)
       (pred_9 obj_15 obj_02)
       (pred_9 obj_15 obj_01)
       (pred_9 obj_15 obj_10)
       (pred_9 obj_01 obj_09)
       (pred_9 obj_01 obj_08)
       (pred_9 obj_01 obj_15)
       (pred_9 obj_08 obj_16)
       (pred_9 obj_08 obj_01)
       (pred_9 obj_04 obj_20)
       (pred_9 obj_04 obj_21)
       (pred_9 obj_04 obj_13)
       (pred_9 obj_21 obj_24)
       (pred_9 obj_21 obj_02)
       (pred_9 obj_21 obj_10)
       (pred_9 obj_21 obj_04)
       (pred_9 obj_02 obj_30)
       (pred_9 obj_02 obj_09)
       (pred_9 obj_02 obj_15)
       (pred_9 obj_02 obj_21)
       (pred_9 obj_09 obj_06)
       (pred_9 obj_09 obj_16)
       (pred_9 obj_09 obj_01)
       (pred_9 obj_09 obj_02)
       (pred_9 obj_16 obj_29)
       (pred_9 obj_16 obj_08)
       (pred_9 obj_16 obj_09)
       (pred_9 obj_20 obj_05)
       (pred_9 obj_20 obj_24)
       (pred_9 obj_20 obj_04)
       (pred_9 obj_24 obj_17)
       (pred_9 obj_24 obj_30)
       (pred_9 obj_24 obj_21)
       (pred_9 obj_24 obj_20)
       (pred_9 obj_30 obj_23)
       (pred_9 obj_30 obj_06)
       (pred_9 obj_30 obj_02)
       (pred_9 obj_30 obj_24)
       (pred_9 obj_06 obj_11)
       (pred_9 obj_06 obj_29)
       (pred_9 obj_06 obj_09)
       (pred_9 obj_06 obj_30)
       (pred_9 obj_29 obj_25)
       (pred_9 obj_29 obj_16)
       (pred_9 obj_29 obj_06)
       (pred_9 obj_05 obj_14)
       (pred_9 obj_05 obj_17)
       (pred_9 obj_05 obj_20)
       (pred_9 obj_17 obj_12)
       (pred_9 obj_17 obj_23)
       (pred_9 obj_17 obj_24)
       (pred_9 obj_17 obj_05)
       (pred_9 obj_23 obj_26)
       (pred_9 obj_23 obj_11)
       (pred_9 obj_23 obj_30)
       (pred_9 obj_23 obj_17)
       (pred_9 obj_11 obj_22)
       (pred_9 obj_11 obj_25)
       (pred_9 obj_11 obj_06)
       (pred_9 obj_11 obj_23)
       (pred_9 obj_25 obj_28)
       (pred_9 obj_25 obj_29)
       (pred_9 obj_25 obj_11)
       (pred_9 obj_14 obj_12)
       (pred_9 obj_14 obj_05)
       (pred_9 obj_12 obj_26)
       (pred_9 obj_12 obj_17)
       (pred_9 obj_12 obj_14)
       (pred_9 obj_26 obj_22)
       (pred_9 obj_26 obj_23)
       (pred_9 obj_26 obj_12)
       (pred_9 obj_22 obj_28)
       (pred_9 obj_22 obj_11)
       (pred_9 obj_22 obj_26)
       (pred_9 obj_28 obj_25)
       (pred_9 obj_28 obj_22)
       (pred_2 obj_13)
       (pred_2 obj_04)
       (pred_2 obj_05)
       (pred_7  obj_13 obj_18)
       (pred_7  obj_04 obj_27)
       (pred_7  obj_05 obj_27)
       (pred_5 obj_10)
       (pred_5 obj_15)
       (pred_5 obj_01)
       (pred_5 obj_08)
       (pred_5 obj_21)
       (pred_5 obj_02)
       (pred_5 obj_09)
       (pred_5 obj_16)
       (pred_5 obj_20)
       (pred_5 obj_24)
       (pred_5 obj_30)
       (pred_5 obj_06)
       (pred_5 obj_29)
       (pred_5 obj_17)
       (pred_5 obj_23)
       (pred_5 obj_11)
       (pred_5 obj_25)
       (pred_5 obj_14)
       (pred_5 obj_12)
       (pred_5 obj_26)
       (pred_5 obj_22)
       (pred_5 obj_28)

       (pred_6  obj_03 obj_18)
       (pred_6  obj_07 obj_27)
       (pred_6  obj_19 obj_27)
       (pred_3 obj_03 obj_29)
       (pred_3 obj_07 obj_21)
       (pred_3 obj_19 obj_08)
       (pred_1 obj_15)
    )

    (:goal (and
       (pred_3 obj_19 obj_10)
    ))
(:constraints
  (always (not (pred_1 obj_01)))
)
)

; plan
1. (op_1 obj_15 obj_10)
   deleted: (pred_1 obj_15)
   added: (pred_1 obj_10)
   goals met: 0 of 1
2. (op_1 obj_10 obj_21)
   deleted: (pred_1 obj_10)
   added: (pred_1 obj_21)
   goals met: 0 of 1
3. (op_5 obj_21 obj_07)
   deleted: (pred_3 obj_07 obj_21) (pred_12)
   added: (pred_10 obj_07)
   goals met: 0 of 1
4. (op_1 obj_21 obj_10)
   deleted: (pred_1 obj_21)
   added: (pred_1 obj_10)
   goals met: 0 of 1
5. (op_4 obj_10 obj_07)
   deleted: (pred_10 obj_07)
   added: (pred_12) (pred_3 obj_07 obj_10)
   goals met: 0 of 1
6. (op_1 obj_10 obj_15)
   deleted: (pred_1 obj_10)
   added: (pred_1 obj_15)
   goals met: 0 of 1
7. (op_1 obj_15 obj_02)
   deleted: (pred_1 obj_15)
   added: (pred_1 obj_02)
   goals met: 0 of 1
8. (op_1 obj_02 obj_09)
   deleted: (pred_1 obj_02)
   added: (pred_1 obj_09)
   goals met: 0 of 1
9. (op_1 obj_09 obj_16)
   deleted: (pred_1 obj_09)
   added: (pred_1 obj_16)
   goals met: 0 of 1
10. (op_1 obj_16 obj_08)
   deleted: (pred_1 obj_16)
   added: (pred_1 obj_08)
   goals met: 0 of 1
11. (op_5 obj_08 obj_19)
   deleted: (pred_3 obj_19 obj_08) (pred_12)
   added: (pred_10 obj_19)
   goals met: 0 of 1
12. (op_1 obj_08 obj_16)
   deleted: (pred_1 obj_08)
   added: (pred_1 obj_16)
   goals met: 0 of 1
13. (op_1 obj_16 obj_09)
   deleted: (pred_1 obj_16)
   added: (pred_1 obj_09)
   goals met: 0 of 1
14. (op_1 obj_09 obj_02)
   deleted: (pred_1 obj_09)
   added: (pred_1 obj_02)
   goals met: 0 of 1
15. (op_1 obj_02 obj_15)
   deleted: (pred_1 obj_02)
   added: (pred_1 obj_15)
   goals met: 0 of 1
16. (op_1 obj_15 obj_10)
   deleted: (pred_1 obj_15)
   added: (pred_1 obj_10)
   goals met: 0 of 1
17. (op_2 obj_10 obj_07 obj_19)
   deleted: (pred_10 obj_19) (pred_3 obj_07 obj_10)
   added: (pred_10 obj_07) (pred_3 obj_19 obj_10)
   goals met: 1 of 1
